import logging

# 配置日誌
logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(levelname)s - %(message)s', filename='secret_time.log')

# 常量配置
DB_NAME = 'secret_time.db'  # 資料庫檔案名稱
DEFAULT_CATEGORIES = ['房租', '水電費', '物料採購', '設備維護', '行銷費用', '其他']  # 預設支出類別
DEFAULT_TREATMENTS = [  # 預設療程列表，包含名稱、Peak價格、Non-Peak價格、是否為組合療程
    ("超聲波注水護理", 580, 522, 0),
    ("Exuviance果酸煥膚", 650, 585, 0),
    ("24K純金箔排毒煥膚", 720, 648, 0),
    ("等離子抗菌消炎細胞機", 880, 792, 0),
    ("PULXE電脈衝緊緻水光槍", 780, 702, 0),
    ("韓國幹細胞嬰兒針", 980, 882, 0),
    ("Einxel Plus膠原修復針", 1880, 1680, 0),
    ("組合療程：Exuviance果酸煥膚 + 等離子抗菌消炎細胞機", 1071, 963, 1),
    ("組合療程：韓國幹細胞嬰兒針 + 等離子抗菌消炎細胞機", 1395, 1255, 1),
    ("組合療程：Einxel Plus膠原修復針 6次包套", 9926, 9926, 1),
    ("熱能氣化 - 單次脫墨/疣", 0, 0, 0),
    ("熱能氣化 - 10粒", 1600, 1600, 0),
    ("熱能氣化 - 20粒", 1800, 1800, 0),
    ("熱能氣化 - 40粒", 2800, 2800, 0),
    ("熱能氣化 - 任脫 3800", 3800, 3800, 0),
    ("熱能氣化 - 任脫 4800", 4800, 4800, 0)
]